; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-35)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room4)
(at ball14 room4)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
(at ball18 room5)
(at ball19 room5)
(at ball20 room5)
(at ball21 room5)
(at ball22 room6)
(at ball23 room6)
(at ball24 room6)
(at ball25 room6)
(at ball26 room6)
(at ball27 room6)
(at ball28 room6)
(at ball29 room6)
(at ball30 room6)
(at ball31 room6)
(at ball32 room6)
(at ball33 room6)
(at ball34 room6)
(at ball35 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room4)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
(at ball19 room4)
(at ball20 room4)
(at ball21 room5)
(at ball22 room5)
(at ball23 room5)
(at ball24 room5)
(at ball25 room5)
(at ball26 room5)
(at ball27 room5)
(at ball28 room6)
(at ball29 room6)
(at ball30 room6)
(at ball31 room6)
(at ball32 room6)
(at ball33 room6)
(at ball34 room6)
(at ball35 room6)
)
)
)

; plan
1. (pick ball4 rooma left)
   deleted: (at ball4 rooma) (free left)
   added: (carry ball4 left)
   goals met: 22 of 35
2. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 22 of 35
3. (drop ball4 roomb left)
   deleted: (carry ball4 left)
   added: (at ball4 roomb) (free left)
   goals met: 23 of 35
4. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 23 of 35
5. (pick ball27 room6 left)
   deleted: (at ball27 room6) (free left)
   added: (carry ball27 left)
   goals met: 23 of 35
6. (pick ball26 room6 right)
   deleted: (at ball26 room6) (free right)
   added: (carry ball26 right)
   goals met: 23 of 35
7. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 23 of 35
8. (drop ball26 room5 right)
   deleted: (carry ball26 right)
   added: (at ball26 room5) (free right)
   goals met: 24 of 35
9. (drop ball27 room5 left)
   deleted: (carry ball27 left)
   added: (at ball27 room5) (free left)
   goals met: 25 of 35
10. (pick ball20 room5 left)
   deleted: (at ball20 room5) (free left)
   added: (carry ball20 left)
   goals met: 25 of 35
11. (pick ball19 room5 right)
   deleted: (at ball19 room5) (free right)
   added: (carry ball19 right)
   goals met: 25 of 35
12. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 25 of 35
13. (drop ball19 room4 right)
   deleted: (carry ball19 right)
   added: (at ball19 room4) (free right)
   goals met: 26 of 35
14. (drop ball20 room4 left)
   deleted: (carry ball20 left)
   added: (at ball20 room4) (free left)
   goals met: 27 of 35
15. (pick ball13 room4 left)
   deleted: (at ball13 room4) (free left)
   added: (carry ball13 left)
   goals met: 27 of 35
16. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 27 of 35
17. (drop ball13 room3 left)
   deleted: (carry ball13 left)
   added: (at ball13 room3) (free left)
   goals met: 28 of 35
18. (pick ball9 room3 right)
   deleted: (at ball9 room3) (free right)
   added: (carry ball9 right)
   goals met: 28 of 35
19. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 28 of 35
20. (drop ball9 roomb right)
   deleted: (carry ball9 right)
   added: (at ball9 roomb) (free right)
   goals met: 29 of 35
21. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 29 of 35
22. (pick ball25 room6 left)
   deleted: (at ball25 room6) (free left)
   added: (carry ball25 left)
   goals met: 29 of 35
23. (pick ball24 room6 right)
   deleted: (at ball24 room6) (free right)
   added: (carry ball24 right)
   goals met: 29 of 35
24. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 29 of 35
25. (drop ball24 room5 right)
   deleted: (carry ball24 right)
   added: (at ball24 room5) (free right)
   goals met: 30 of 35
26. (drop ball25 room5 left)
   deleted: (carry ball25 left)
   added: (at ball25 room5) (free left)
   goals met: 31 of 35
27. (pick ball18 room5 left)
   deleted: (at ball18 room5) (free left)
   added: (carry ball18 left)
   goals met: 31 of 35
28. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 31 of 35
29. (drop ball18 room4 left)
   deleted: (carry ball18 left)
   added: (at ball18 room4) (free left)
   goals met: 32 of 35
30. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 32 of 35
31. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 32 of 35
32. (pick ball23 room6 left)
   deleted: (at ball23 room6) (free left)
   added: (carry ball23 left)
   goals met: 32 of 35
33. (pick ball22 room6 right)
   deleted: (at ball22 room6) (free right)
   added: (carry ball22 right)
   goals met: 32 of 35
34. (move room6 roomb)
   deleted: (at-robby room6)
   added: (at-robby roomb)
   goals met: 32 of 35
35. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 32 of 35
36. (drop ball22 room5 right)
   deleted: (carry ball22 right)
   added: (at ball22 room5) (free right)
   goals met: 33 of 35
37. (drop ball23 room5 left)
   deleted: (carry ball23 left)
   added: (at ball23 room5) (free left)
   goals met: 34 of 35
38. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 34 of 35
39. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 34 of 35
40. (pick ball8 room3 left)
   deleted: (at ball8 room3) (free left)
   added: (carry ball8 left)
   goals met: 34 of 35
41. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 34 of 35
42. (drop ball8 roomb left)
   deleted: (carry ball8 left)
   added: (at ball8 roomb) (free left)
   goals met: 35 of 35
